data-collection-plan/data-collection.org

* Item Wishlist

|------------------------------------------+----------+-----------------+----------|
| Scale                                    | Nickname | Number of Items | Priority |
|------------------------------------------+----------+-----------------+----------|
|------------------------------------------+----------+-----------------+----------|
| Demographic                              | Demo     |               4 |        4 |
|Positive Youth Leadership Identity Scale  | PYLI     |              23 |       23 |
| Social Desirability                      | SD       |              14 |        0 |
| Youth Hope Scale                         | YH       |               6 |        0 |
| Goal-Orientation Scale                   | GO       |              16 |        0 |
| Youth Voice                              | YV       |              29 |        0 |
| Hopelessness Scale (for Children?)       | HLN      |              17 |        0 |
| Big 5                                    |          |              46 |       46 |
|------------------------------------------+----------+-----------------+----------|
| PYL+ SUM                                 |          |             155 |       73 |
|------------------------------------------+----------+-----------------+----------|
| SLC - Learning and Reasoning             | SLC-LR   |              31 |       31 |
| SLC - Communication                      | SLC-C    |              23 |       23 |
| SLC - Civic Responsibility               | SLC-CR   |              19 |       19 |
| SLC - Personal Behavior                  | SLC-PB   |              34 |       34 |
| SLC - Strategic Planning                 | SLC-SP   |              16 |       16 |
| SLC - Self Awareness and Development     | SLC-SAD  |              19 |       19 |
| SLC - Group Dynamics                     | SLC-GD   |              13 |       13 |
| SLC - Interpersonal Interaction          | SLC-II   |              34 |       34 |
|------------------------------------------+----------+-----------------+----------|
| SLC+ SUM                                 |          |             189 |      189 |
|------------------------------------------+----------+-----------------+----------|
| Total                                    |          |             344 |      262 |
#+TBLFM: @10$3=vsum(@2..@9)::@19$3=vsum(@11..@18)::@20$3=(@10 + @19)::@10$4=vsum(@2..@9)::@19$4=vsum(@11..@18)::@20$4=(@10 + @19)

* Positive Youth Leadership Identity Scale

| Scale   | Nickname | Number of Items |
|---------+----------+-----------------|
| PYLI    | PYLI     |              23 |
|---------+----------+-----------------|
| lse-lro |          |               7 |
| ldrdev  |          |               3 |
| serd    |          |               3 |
| empsi   |          |               4 |
| optgw   |          |               3 |
| grphop  |          |               3 |

* SLC - Scale Breakdown

| Scale                        | Nickname | Number of Items  |
|------------------------------+----------+------------------|
| SLC - Learning and Reasoning | SLC-LR   |               31 |
|------------------------------+----------+------------------|
| Research                     |          |                3 |
| Other Perspectives           |          |                3 |
| Reflection and Application   |          |                3 |
| Systems Thinking             |          |                3 |
| Analysis                     |          |                3 |
| Synthesis                    |          |                3 |
| Evaluation                   |          |                3 |
| Idea Generation              |          |                3 |
| Problem Solving              |          |                3 |
| Decision Making              |          |                3 |

| Scale                          | Nickname | Number of Items |
|--------------------------------+----------+-----------------|
| SLC - Communication            | SLC-C    |              23 |
|--------------------------------+----------+-----------------|
| Verbal Communication           |          |               3 |
| Nonverbal Communication        |          |               3 |
| Listening                      |          |               3 |
| Writing                        |          |               3 |
| Facilitation                   |          |               3 |
| Conflict Negotiation           |          |               3 |
| Advocating for a Point of View |          |               3 |

| Scale                      | Nickname | Number of Items |
|----------------------------+----------+-----------------|
| SLC - Civic Responsibility | SLC-CR   |              19 |
|----------------------------+----------+-----------------|
| Diversity                  |          |               3 |
| Others’ Circumstances      |          |               3 |
| Inclusion                  |          |               3 |
| Social Justice             |          |               3 |
| Social Responsibility      |          |               3 |
| Service                    |          |               3 |

| Scale                                | Nickname | Number of Items |
|--------------------------------------+----------+-----------------|
| SLC - Personal Behavior              | SLC-PB   |              34 |
|--------------------------------------+----------+-----------------|
| Initiative                           |          |               3 |
| Functioning Independently            |          |               3 |
| Follow-Through                       |          |               3 |
| Responsibility for Personal Behavior |          |               3 |
| Ethics                               |          |               3 |
| Responding to Ambiguity              |          |               3 |
| Responding to Change                 |          |               3 |
| Resiliency                           |          |               3 |
| Positive Attitude                    |          |               3 |
| Confidence                           |          |               3 |
| Excellence                           |          |               3 |

| Scale                      | Nickname | Number of Items |
|----------------------------+----------+-----------------|
| SLC - Strategic Planning   | SLC-SP   |              16 |
|----------------------------+----------+-----------------|
| Strategic Planning Mission |          |               3 |
| Vision                     |          |               3 |
| Goals                      |          |               3 |
| Plan                       |          |               3 |
| Organization               |          |               3 |

| Scale                                | Nickname | Number of Items |
|--------------------------------------+----------+-----------------|
| SLC - Self Awareness and Development | SLC-SAD  |              19 |
|--------------------------------------+----------+-----------------|
| Self-Understanding                   |          |               3 |
| Personal Values                      |          |               3 |
| Personal Contributions               |          |               3 |
| Scope of Competence                  |          |               3 |
| Receiving Feedback                   |          |               3 |
| Self-Development                     |          |               3 |

| Scale                   | Nickname | Number of Items |
|-------------------------+----------+-----------------|
| SLC - Group Dynamics    | SLC-GD   |              13 |
|-------------------------+----------+-----------------|
| Organizational Behavior |          |               3 |
| Power Dynamics          |          |               3 |
| Group Development       |          |               3 |
| Creating Change         |          |               3 |

| Scale                           | Nickname | Number of Items |
|---------------------------------+----------+-----------------|
| SLC - Interpersonal Interaction | SLC-II   |              34 |
|---------------------------------+----------+-----------------|
| Productive Relationships        |          |               3 |
| Appropriate Interaction         |          |               3 |
| Helping Others                  |          |               3 |
| Empathy                         |          |               3 |
| Mentoring                       |          |               3 |
| Motivation                      |          |               3 |
| Others’ Contributions           |          |               3 |
| Empowerment                     |          |               3 |
| Providing Feedback              |          |               3 |
| Supervision                     |          |               3 |
| Collaboration                   |          |               3 |
