data-collection-plan/data-collection.tex
% Created 2019-05-01 Wed 04:21
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{ALEX}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={ALEX},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.2.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Item Wishlist}
\label{sec:org3b86273}

\begin{center}
\begin{tabular}{llrr}
\hline
Scale & Nickname & Number of Items & Priority\\
\hline
\hline
Demographic & Demo & 4 & 4\\
Positive Youth Leadership Identity Scale & PYLI & 23 & 23\\
Social Desirability & SD & 14 & 0\\
Youth Hope Scale & YH & 6 & 0\\
Goal-Orientation Scale & GO & 16 & 0\\
Youth Voice & YV & 29 & 0\\
Hopelessness Scale (for Children?) & HLN & 17 & 0\\
Big 5 &  & 46 & 46\\
\hline
PYL+ SUM &  & 155 & 73\\
\hline
SLC - Learning and Reasoning & SLC-LR & 31 & 31\\
SLC - Communication & SLC-C & 23 & 23\\
SLC - Civic Responsibility & SLC-CR & 19 & 19\\
SLC - Personal Behavior & SLC-PB & 34 & 34\\
SLC - Strategic Planning & SLC-SP & 16 & 16\\
SLC - Self Awareness and Development & SLC-SAD & 19 & 19\\
SLC - Group Dynamics & SLC-GD & 13 & 13\\
SLC - Interpersonal Interaction & SLC-II & 34 & 34\\
\hline
SLC+ SUM &  & 189 & 189\\
\hline
Total &  & 344 & 262\\
\end{tabular}
\end{center}

\section{Positive Youth Leadership Identity Scale}
\label{sec:org430b08c}

\begin{center}
\begin{tabular}{llr}
Scale & Nickname & Number of Items\\
\hline
PYLI & PYLI & 23\\
\hline
lse-lro &  & 7\\
ldrdev &  & 3\\
serd &  & 3\\
empsi &  & 4\\
optgw &  & 3\\
grphop &  & 3\\
\end{tabular}
\end{center}

\section{SLC - Scale Breakdown}
\label{sec:orgc6d476d}

\begin{center}
\begin{tabular}{llr}
Scale & Nickname & Number of Items\\
\hline
SLC - Learning and Reasoning & SLC-LR & 31\\
\hline
Research &  & 3\\
Other Perspectives &  & 3\\
Reflection and Application &  & 3\\
Systems Thinking &  & 3\\
Analysis &  & 3\\
Synthesis &  & 3\\
Evaluation &  & 3\\
Idea Generation &  & 3\\
Problem Solving &  & 3\\
Decision Making &  & 3\\
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{llr}
Scale & Nickname & Number of Items\\
\hline
SLC - Communication & SLC-C & 23\\
\hline
Verbal Communication &  & 3\\
Nonverbal Communication &  & 3\\
Listening &  & 3\\
Writing &  & 3\\
Facilitation &  & 3\\
Conflict Negotiation &  & 3\\
Advocating for a Point of View &  & 3\\
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{llr}
Scale & Nickname & Number of Items\\
\hline
SLC - Civic Responsibility & SLC-CR & 19\\
\hline
Diversity &  & 3\\
Others’ Circumstances &  & 3\\
Inclusion &  & 3\\
Social Justice &  & 3\\
Social Responsibility &  & 3\\
Service &  & 3\\
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{llr}
Scale & Nickname & Number of Items\\
\hline
SLC - Personal Behavior & SLC-PB & 34\\
\hline
Initiative &  & 3\\
Functioning Independently &  & 3\\
Follow-Through &  & 3\\
Responsibility for Personal Behavior &  & 3\\
Ethics &  & 3\\
Responding to Ambiguity &  & 3\\
Responding to Change &  & 3\\
Resiliency &  & 3\\
Positive Attitude &  & 3\\
Confidence &  & 3\\
Excellence &  & 3\\
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{llr}
Scale & Nickname & Number of Items\\
\hline
SLC - Strategic Planning & SLC-SP & 16\\
\hline
Strategic Planning Mission &  & 3\\
Vision &  & 3\\
Goals &  & 3\\
Plan &  & 3\\
Organization &  & 3\\
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{llr}
Scale & Nickname & Number of Items\\
\hline
SLC - Self Awareness and Development & SLC-SAD & 19\\
\hline
Self-Understanding &  & 3\\
Personal Values &  & 3\\
Personal Contributions &  & 3\\
Scope of Competence &  & 3\\
Receiving Feedback &  & 3\\
Self-Development &  & 3\\
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{llr}
Scale & Nickname & Number of Items\\
\hline
SLC - Group Dynamics & SLC-GD & 13\\
\hline
Organizational Behavior &  & 3\\
Power Dynamics &  & 3\\
Group Development &  & 3\\
Creating Change &  & 3\\
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{llr}
Scale & Nickname & Number of Items\\
\hline
SLC - Interpersonal Interaction & SLC-II & 34\\
\hline
Productive Relationships &  & 3\\
Appropriate Interaction &  & 3\\
Helping Others &  & 3\\
Empathy &  & 3\\
Mentoring &  & 3\\
Motivation &  & 3\\
Others’ Contributions &  & 3\\
Empowerment &  & 3\\
Providing Feedback &  & 3\\
Supervision &  & 3\\
Collaboration &  & 3\\
\end{tabular}
\end{center}
\end{document}